drxnch/device-stm32/Firmware/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"
#include "stm32l4xx_hal_tim.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ssd1306.h"
#include "ssd1306_tests.h"
#include "ssd1306_fonts.h"
#include "display.h"

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef enum {
  STATE_HOME,
  STATE_TIMER,
  STATE_TIMER_SET,
  STATE_TIMER_DONE,
  STATE_ALARM,
  STATE_MUSIC,
  STATE_SETTINGS,
} State_t;

typedef enum {
  NONE,
  EVENT_SCROLL_HOLD,
  EVENT_SCROLL_PRESS,
  EVENT_SCROLL_CLOCKWISE,
  EVENT_SCROLL_ANTICLOCKWISE,
} Event_t;

typedef struct {
  char *name;
  State_t next_screen;  
} menu_screen;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

//Debugging defines
#define LD3_ON  (HAL_GPIO_WritePin(LD3_GPIO_Port,LD3_Pin, GPIO_PIN_SET))
#define LD3_OFF  (HAL_GPIO_WritePin(LD3_GPIO_Port,LD3_Pin, GPIO_PIN_RESET))
#define LD2_ON  (HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin, GPIO_PIN_SET))
#define LD2_OFF  (HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin, GPIO_PIN_RESET))



#define PLAY_PRESSED (HAL_GPIO_ReadPin(BUTTON_PLAY_GPIO_Port, BUTTON_PLAY_Pin) == GPIO_PIN_SET)
#define REWIND_PRESSED (HAL_GPIO_ReadPin(BUTTON_REWIND_GPIO_Port, BUTTON_REWIND_Pin) == GPIO_PIN_SET)
#define SKIP_PRESSED (HAL_GPIO_ReadPin(BUTTON_SKIP_GPIO_Port, BUTTON_SKIP_Pin) == GPIO_PIN_SET)
#define VOL_DOWN_PRESSED (HAL_GPIO_ReadPin(BUTTON_VOL_DOWN_GPIO_Port, BUTTON_VOL_DOWN_Pin) == GPIO_PIN_SET)
#define VOL_UP_PRESSED   (HAL_GPIO_ReadPin(BUTTON_VOL_UP_GPIO_Port, BUTTON_VOL_UP_Pin) == GPIO_PIN_SET)
#define SCROLL_BUTTON_PRESSED (HAL_GPIO_ReadPin(BUTTON_SCROLL_GPIO_Port, BUTTON_SCROLL_Pin) == GPIO_PIN_SET)

#define SCROLL_KEY_HOLD_TIME 1000
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef hlpuart1;

SAI_HandleTypeDef hsai_BlockA1;
DMA_HandleTypeDef hdma_sai1_a;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
/*
  _____  _____  _______      __       _______ ______   __      __     _____  _____          ____  _      ______  _____ 
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____|  \ \    / /\   |  __ \|_   _|   /\   |  _ \| |    |  ____|/ ____|
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__      \ \  / /  \  | |__) | | |    /  \  | |_) | |    | |__  | (___   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|      \ \/ / /\ \ |  _  /  | |   / /\ \ |  _ <| |    |  __|  \___ \  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____      \  / ____ \| | \ \ _| |_ / ____ \| |_) | |____| |____ ____) | 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|      \/_/    \_\_|  \_\_____/_/    \_\____/|______|______|_____/ 
                                                     
                                                                  
*/
Event_t input_event;
volatile State_t currentState = STATE_HOME;

/* GPIO Inputs */
uint8_t input_register;
#define SCROLL_KEY_BIT 3
#define REWIND_KEY_BIT 2
#define PLAY_KEY_BIT 1
#define SKIP_KEY_BIT 0

uint8_t scroll_register;
#define SCROLL_FLAG_BIT 1
#define CLOCKWISE_SCROLL_BIT 0
#define ANTICLOCKWISE_SCROLL_BIT 2
bool scroll_key_pressed = false;
volatile bool scroll_key_held = false;

static uint32_t phase = 0;
//Global Variables
uint8_t music_volume = 0;
uint8_t timer_length=0;
uint8_t time_elapsed=0;

volatile bool scroll_key_release_pending = false;

static bool test_refresh = false;
static uint8_t draw_state = 0;
static uint32_t button_hold_time = 0;
//Initialisation Code
uint8_t last_state = 0;
uint8_t current_state = 0;
uint8_t next_state = 0;
bool down_button_last = false;

      bool setting_timer = false;
// SDMMC
FATFS MyFatFS; 
FIL MyFile;    
FRESULT res; 
UINT bw;  
uint32_t byteswritten;

// Audio
#define AUDIO_BUF_SIZE 4096 
#define READBUF_SIZE 4096
int16_t audio_buffer[AUDIO_BUF_SIZE]; // The main buffer
uint8_t playing = 0;                   // State flag
UINT bytes_read;                       // To track SD card progress
uint8_t readBuf[READBUF_SIZE]; // Buffer for encoded MP3 data
int16_t outBuf[2 * 1152];      // Buffer for decoded PCM data
uint32_t adc_buffer[1];
uint8_t timer_ready = 0;
uint8_t last_button_state = 0; 

// Display
uint8_t music_option = 0;
uint16_t gpio_pin = 0;
uint32_t duration;
uint8_t button_scroll_flag = 0;


// Miscellaneous (Buttons, Sensors, States etc.)
// All Inputs



uint8_t previous_volume = 0;
volatile int8_t scroll_value = 0;
int8_t previous_scroll_value = 0;
uint8_t refresh_needed = 0;
bool scroll_button_hold =false;

uint8_t option = 0;
GPIO_PinState s1, s2 = GPIO_PIN_RESET;

  menu_screen main_menu[] = {
    {"Music", STATE_MUSIC},
    {"Timer", STATE_TIMER},
    {"Alarm", STATE_ALARM},
    {"Settings", STATE_SETTINGS}
  };

  menu_screen timer_menu[] = {
    {"Back", STATE_HOME},
    {"Preset Timers", STATE_HOME},
    {"Set Timer", STATE_TIMER_SET}
  };

  menu_screen timer_preset_menu[] = {
    {"Back", STATE_HOME},
    {"5 mins", STATE_HOME},
    {"10 mins",STATE_HOME}
  };

  // menu_screen alarm_menu[] = {
  //   {"Back", MAIN_MENU},
  //   {"Preset Alarms", PRESET_ALARM_MENU},
  //   {"Set Alarm", SET_ALARM_MENU}
  // };

/* USER CODE END PV */

