drxnch/device-stm32/Firmware/Core/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SAI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_CRC_Init(void);
static void MX_TIM2_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/*
  _____  _____  _______      __       _______ ______   _    _  _____ ______ _____     _____  ____  _____  ______  
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____| | |  | |/ ____|  ____|  __ \   / ____|/ __ \|  __ \|  ____| 
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__    | |  | | (___ | |__  | |__) | | |    | |  | | |  | | |__   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|   | |  | |\___ \|  __| |  _  /  | |    | |  | | |  | |  __|  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____  | |__| |____) | |____| | \ \  | |____| |__| | |__| | |____ 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|  \____/|_____/|______|_|  \_\  \_____|\____/|_____/|______|
                                                                                   
                              
*/

// void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
//   timer_ready = 1;
// 	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_7);
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM2) {
        time_elapsed++;
        if ((time_elapsed / 60) >= timer_length) {
            HAL_TIM_Base_Stop_IT(&htim2);
            currentState = STATE_TIMER_DONE;
            refresh_needed = 1;
        }
    }
}

// }

void Check_Scroll_Key_Hold() {
    if (scroll_key_release_pending) {
        scroll_key_release_pending = false;
        button_hold_time = __HAL_TIM_GET_COUNTER(&htim1);
        HAL_TIM_Base_Stop(&htim1);
        scroll_key_held = false;
        if (button_hold_time >= SCROLL_KEY_HOLD_TIME) {
            input_event = EVENT_SCROLL_HOLD;
        } else {
            input_event = EVENT_SCROLL_PRESS;
        }
    }
}

void Check_Scroll() {
  if (scroll_register & (1 << SCROLL_FLAG_BIT)) {
    if (scroll_register & (1 << CLOCKWISE_SCROLL_BIT)) {
      input_event = EVENT_SCROLL_CLOCKWISE;
    }
    if (scroll_register & (1 << ANTICLOCKWISE_SCROLL_BIT)) {
      input_event = EVENT_SCROLL_ANTICLOCKWISE;
    }
    scroll_register &= ~(0b00000111); // Clear scroll direction bits and flag
  }
}

void Check_Volume() {
  if (music_volume > 100) music_volume = 100;
  else if (music_volume < 0) music_volume = 0;
}

void Check_Music_Buttons() {
  if ((input_register & (1 << PLAY_PRESSED)) || (input_register & (1 << SKIP_PRESSED)) || (input_register & (1 << REWIND_PRESSED))) {
    //Play Song
    DrawTextToScreen("would play song");
  }
}

void UI_State_Machine() {
  if (input_event == NONE) return;
  switch (currentState) {
    case STATE_HOME:
      if (input_event == EVENT_SCROLL_PRESS) {
        currentState = main_menu[option-1].next_screen;
        refresh_needed=1;
        option=1;
      }
      if (input_event == EVENT_SCROLL_CLOCKWISE) {option++;refresh_needed=1;}
      if (input_event == EVENT_SCROLL_ANTICLOCKWISE) {option--;refresh_needed=1;}
      break;
    case STATE_TIMER:
      if (input_event == EVENT_SCROLL_PRESS) {
        currentState = timer_menu[option-1].next_screen;
        refresh_needed=1;
        option=1;
      }
      if (input_event == EVENT_SCROLL_CLOCKWISE) {option++;refresh_needed=1;}
      if (input_event == EVENT_SCROLL_ANTICLOCKWISE) {option--;refresh_needed=1;}
      if (input_event == EVENT_SCROLL_HOLD) {
        currentState = STATE_HOME;
        refresh_needed=1;
        option=1;
      }
      break;
    case STATE_TIMER_SET:
      if (input_event == EVENT_SCROLL_CLOCKWISE && !setting_timer) {option++;refresh_needed=1;}
      else if (input_event == EVENT_SCROLL_ANTICLOCKWISE && !setting_timer) {option--;refresh_needed=1;}

      else if (option==1 && input_event == EVENT_SCROLL_PRESS) {currentState=STATE_HOME;refresh_needed=1;option=1;}

      else if (option == 2 && !setting_timer && input_event == EVENT_SCROLL_PRESS) {
        setting_timer = true;
      refresh_needed=1;
      }
      else if (option == 2 && setting_timer && input_event == EVENT_SCROLL_CLOCKWISE) {
        timer_length++;
        refresh_needed=1;
      }
      else if (option == 2 && setting_timer && input_event == EVENT_SCROLL_ANTICLOCKWISE) {
        timer_length--;        
        refresh_needed=1;
      }
      else if (option == 2 && setting_timer && input_event == EVENT_SCROLL_PRESS) {
        setting_timer = false;
        refresh_needed=1;
      }
      else if (option == 3 && input_event == EVENT_SCROLL_PRESS) {
        HAL_TIM_Base_Start_IT(&htim2);
        currentState = STATE_HOME;
        refresh_needed = 1;
      }

      else if (input_event == EVENT_SCROLL_HOLD) {
        
        currentState = STATE_HOME;
            setting_timer = false;  // add this
        refresh_needed=1;
        option=1;
      }
      break;
    case STATE_TIMER_DONE:
      if (input_event == EVENT_SCROLL_PRESS) {
        currentState = STATE_HOME;
        refresh_needed=1;
        option=1;
      }
    default:
      break;
  }
  input_event = NONE;
  if (option > 4) option = 1;
  if (option < 1) option = 4;
  if (refresh_needed) {
    refresh_needed=0;
    switch (currentState) {
      case STATE_HOME: LD3_OFF; DisplayOptions(option,main_menu[0].name, main_menu[1].name, main_menu[2].name, main_menu[3].name); break;
      case STATE_TIMER: DisplayOptionsThree(option, timer_menu[0].name, timer_menu[1].name, timer_menu[2].name); break;
      case STATE_TIMER_SET: timerSetUI(option, timer_length, setting_timer); break;
      case STATE_TIMER_DONE: LD3_ON; DrawTextToScreen("Timer Done"); break;
      default: break;
    } 
  }
}

